#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.github_repo["go-game-of-life"].github_repository.repo: Refreshing state... [id=go-game-of-life]
module.github_repo["summit-formule"].github_repository.repo: Refreshing state... [id=summit-formule]
module.github_repo["dpd-test"].github_repository.repo: Refreshing state... [id=dpd-test]
module.github_repo["anna-helmova"].github_repository.repo: Refreshing state... [id=anna-helmova]
module.github_repo["wsl-setup"].github_repository.repo: Refreshing state... [id=wsl-setup]
module.github_repo["apprepo-dash"].github_repository.repo: Refreshing state... [id=apprepo-dash]
module.github_repo["go-names"].github_repository.repo: Refreshing state... [id=go-names]
module.github_repo["go-cci-trigger"].github_repository.repo: Refreshing state... [id=go-cci-trigger]
module.github_repo["fiddo"].github_repository.repo: Refreshing state... [id=fiddo]
module.github_repo["toulky"].github_repository.repo: Refreshing state... [id=toulky]
module.github_repo["vaclav-dvorak"].github_repository.repo: Refreshing state... [id=vaclav-dvorak]
module.github_repo["vccsturm"].github_repository.repo: Refreshing state... [id=vccsturm]
module.github_repo["bara"].github_repository.repo: Refreshing state... [id=bara]
module.github_repo["summit-pokemon"].github_repository.repo: Refreshing state... [id=summit-pokemon]
module.github_repo["frajer"].github_repository.repo: Refreshing state... [id=frajer]
module.github_repo["roguna"].github_repository.repo: Refreshing state... [id=roguna]
module.github_repo["game-of-life"].github_repository.repo: Refreshing state... [id=game-of-life]
module.github_repo["maze"].github_repository.repo: Refreshing state... [id=maze]
module.github_repo["go101"].github_repository.repo: Refreshing state... [id=go101]
module.github_repo["go-api-hello-world"].github_repository.repo: Refreshing state... [id=go-api-hello-world]
module.github_repo["mefbox"].github_repository.repo: Refreshing state... [id=mefbox]
module.github_repo["go-telegram-test"].github_repository.repo: Refreshing state... [id=go-telegram-test]
module.github_repo["devops-workshop"].github_repository.repo: Refreshing state... [id=devops-workshop]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.github_repo["go-names"].github_repository.repo has changed
  ~ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + branches               = [
          + {
              + name      = "main"
              + protected = false
            },
        ]
      ~ etag                   = "W/\"e0747e4851a54bcdbd9edd87ce2693c994e37120a347b157ffc4727f7ef94f90\"" -> "W/\"8433cc92ccabf55ada40148b319fd7a177d2af105193e2975a6cfa0ff6216aa2\""
        id                     = "go-names"
        name                   = "go-names"
      + topics                 = []
        # (26 unchanged attributes hidden)
    }

  # module.github_repo["vccsturm"].github_repository.repo has changed
  ~ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + branches               = [
          + {
              + name      = "main"
              + protected = false
            },
        ]
      ~ etag                   = "W/\"f8697e7417d8b4eefe0de0692d557e4ade9d065b1e430bdb17b97573f0a76bd8\"" -> "W/\"01b09c0b437bc0f84d49c93d4edf882d43eb73013ec086461578b2e13efb044d\""
        id                     = "vccsturm"
        name                   = "vccsturm"
        # (25 unchanged attributes hidden)
    }

  # module.github_repo["wsl-setup"].github_repository.repo has changed
  ~ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + branches               = [
          + {
              + name      = "main"
              + protected = false
            },
        ]
      ~ etag                   = "W/\"98b6380049eba0e3b4c739b3740360de11c2ca3ea8de89e926c1bb6471fea4c5\"" -> "W/\"49b332862b3c9e48a1bcc61a0adcacc64051272a29ea2548dd9a98554d65313d\""
        id                     = "wsl-setup"
        name                   = "wsl-setup"
        # (25 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.github_repo["anna-helmova"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + branches               = (known after apply)
        id                     = "anna-helmova"
        name                   = "anna-helmova"
        # (26 unchanged attributes hidden)
    }

  # module.github_repo["apprepo-dash"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + branches               = (known after apply)
        id                     = "apprepo-dash"
        name                   = "apprepo-dash"
        # (26 unchanged attributes hidden)
    }

  # module.github_repo["bara"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + branches               = (known after apply)
        id                     = "bara"
        name                   = "bara"
        # (26 unchanged attributes hidden)
    }

  # module.github_repo["devops-workshop"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + branches               = (known after apply)
        id                     = "devops-workshop"
        name                   = "devops-workshop"
        # (26 unchanged attributes hidden)
    }

  # module.github_repo["dpd-test"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + branches               = (known after apply)
        id                     = "dpd-test"
        name                   = "dpd-test"
        # (26 unchanged attributes hidden)
    }

  # module.github_repo["fiddo"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + branches               = (known after apply)
        id                     = "fiddo"
        name                   = "fiddo"
        # (26 unchanged attributes hidden)
    }

  # module.github_repo["frajer"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + branches               = (known after apply)
        id                     = "frajer"
        name                   = "frajer"
        # (26 unchanged attributes hidden)
    }

  # module.github_repo["game-of-life"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + branches               = (known after apply)
        id                     = "game-of-life"
        name                   = "game-of-life"
        # (26 unchanged attributes hidden)
    }

  # module.github_repo["go-api-hello-world"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + branches               = (known after apply)
        id                     = "go-api-hello-world"
        name                   = "go-api-hello-world"
        # (26 unchanged attributes hidden)
    }

  # module.github_repo["go-cci-trigger"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + branches               = (known after apply)
        id                     = "go-cci-trigger"
        name                   = "go-cci-trigger"
        # (28 unchanged attributes hidden)
    }

  # module.github_repo["go-game-of-life"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + branches               = (known after apply)
        id                     = "go-game-of-life"
        name                   = "go-game-of-life"
        # (28 unchanged attributes hidden)
    }

  # module.github_repo["go-mandel"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Simple implementation of z^2 mandelbrot set"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Go"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "go-mandel"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = false
    }

  # module.github_repo["go-telegram-test"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + branches               = (known after apply)
        id                     = "go-telegram-test"
        name                   = "go-telegram-test"
        # (28 unchanged attributes hidden)
    }

  # module.github_repo["go101"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + branches               = (known after apply)
        id                     = "go101"
        name                   = "go101"
        # (26 unchanged attributes hidden)
    }

  # module.github_repo["maze"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + branches               = (known after apply)
        id                     = "maze"
        name                   = "maze"
        # (26 unchanged attributes hidden)
    }

  # module.github_repo["mefbox"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + branches               = (known after apply)
        id                     = "mefbox"
        name                   = "mefbox"
        # (26 unchanged attributes hidden)
    }

  # module.github_repo["roguna"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + branches               = (known after apply)
        id                     = "roguna"
        name                   = "roguna"
        # (28 unchanged attributes hidden)
    }

  # module.github_repo["summit-formule"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + branches               = (known after apply)
        id                     = "summit-formule"
        name                   = "summit-formule"
        # (26 unchanged attributes hidden)
    }

  # module.github_repo["summit-pokemon"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + branches               = (known after apply)
        id                     = "summit-pokemon"
        name                   = "summit-pokemon"
        # (26 unchanged attributes hidden)
    }

  # module.github_repo["toulky"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + branches               = (known after apply)
        id                     = "toulky"
        name                   = "toulky"
        # (26 unchanged attributes hidden)
    }

  # module.github_repo["vaclav-dvorak"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + branches               = (known after apply)
        id                     = "vaclav-dvorak"
        name                   = "vaclav-dvorak"
        # (26 unchanged attributes hidden)
    }

Plan: 1 to add, 20 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @vaclav-dvorak, Action: `pull_request`*